registration_message = 'Вас ещё нет в базе данных, поэтому пройдите простую процедуру регистрации'

registration_success_message = '✅ | Регистрация\n\n' \
                               'Отлично, Вы зарегистрировались, введенные данные можно посмотреть/отредактировать ' \
                               'в личном кабинете, нажав на "Изменить данные".\n\n'\
                               '❓ | Напишите: Помощь, если желаете узнать все доступные команды.'

registration_alt_help_message = 'Для регистрации в текстовом режиме, введите команду.\n\n' \
                                '❗Формат:\n' \
                                'reg <группа в которой вы хотите зарегистрироваться>\n\n' \
                                'Пример:\n' \
                                '✔reg ИУК1-11Б - Регистрация в группе ИУК1-11Б\n' \
                                '✔reg 2 курс ИУК2-31Б - Регистрация в группе ИУК2-31Б\n' \
                                '✔reg магистры ИУК3-11М - Регистрация в группе ИУК3-11М\n' \

unknown_message = '⚠ | Извините, но я Вас не понимаю.\n' \
                  '❓ | Напишите: "Помощь" (без " "), чтобы посмотреть доступные команды.'

auto_posting_on_help_message = '📄 | Инструкция\n\n' \
                               'Чтобы включить автоматическое расписание, введите команду.\n\n' \
                               '❗Формат:\n' \
                               'ар ЧЧ:ММ <сегодня/завтра>\n\n' \
                               'Пример:\n' \
                               '✔ар 08:00 - Включает отправку расписания на сегодня в 08:00\n' \
                               '✔ap 08:00 сегодня - Отправляет расписание на сегодня в 08:00\n' \
                               '✔ap 20:00 завтра - Отправляет расписание на завтра в 20:00'

auto_posting_off_message = '🔒 | Автоматическое расписание отключено'

back_message = '📖 | Главное меню'

other_message = '📎 | Прочее'

faq_message = '📌 | FAQ\n' \
              'Часто задаваемые вопросы.\n' \
              'https://vk.cc/aAnaAW\n' \
              'Если Вы не нашли ответ на свой вопрос, то можете задать его здесь.\n' \
              'https://vk.cc/aAnaPN'

error_message = 'Случилось что то странное, попробуйте ввести команду заново'

resources_message = '📍 | Ресурсы\n' \
                    '1. Сайт\n' \
                    'https://vk.cc/2JaFvF\n' \
                    '2. ВКонтакте\n' \
                    'https://vk.cc/axyv0L\n' \
                    '3. Студенческий клуб КФ МГТУ им. Н. Э. Баумана\n' \
                    'https://vk.cc/8ZLJUQ\n' \
                    '4. Студенческий спортивный клуб КФ МГТУ\n' \
                    'https://vk.cc/3fouzp\n' \
                    '5. Профсоюзная жизнь в КФ МГТУ им.Н.Э.Баумана\n' \
                    'https://vk.cc/3xC8av\n' \
                    '6. WhatsApp\n' \
                    'https://vk.cc/aAn8Cd\n' \
                    '7. Instagram\n' \
                    'https://vk.cc/aAn8SJ\n' \
                    '8. Telegram\n' \
                    'https://vk.cc/aAn8LL\n' \
                    '9. YouTube\n' \
                    'https://vk.cc/aAn8QO\n' \
                    '10. TikTok\n' \
                    'https://vk.cc/aAn8Jm\n'

start_message = '💬 | Вас приветствует Helper КФ МГТУ им Н.Э Баумана'

user_info_title_message = '💻 | Ваш личный кабинет'
user_info_faculty_message = '👥 | Курс'
user_info_group_message = '💾 | Группа'
user_info_ap_time_message = '📤 | Автоматическая рассылка'
user_info_ap_type_message = '📋 | Тип рассылки'

schedule_info_message = '📊 | Ваше расписание'

settings_message = '⚙ | Настройки'

report_help_message = '📄 | Инструкция\n\n' \
                      'Чтобы отправить отзыв о работе бота введите команду.\n\n' \
                      '❗Формат:\n' \
                      'отзыв <ваше сообщение>\n\n' \
                      'Пример:\n' \
                      '✔отзыв обнаружена ошибка в расписании\n'

report_ok_message = 'Сообщение принято'
